results/run-30vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 23 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 39 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 62 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 86 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m12.0s), 30/30 VUs, 109 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 121 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 147 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 171 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 186 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 209 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 228 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 251 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 272 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m21.0s), 30/30 VUs, 291 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 316 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 332 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 356 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 375 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 395 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 416 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 438 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 460 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 479 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 501 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 519 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 544 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 562 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 586 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 606 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 623 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 645 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 663 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 683 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 705 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 727 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 744 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 766 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 786 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 806 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 827 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 844 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 864 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 886 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 903 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 924 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 945 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m53.0s/1m0s

running (0m54.0s), 30/30 VUs, 965 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 985 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 1008 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 1027 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 1045 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 1068 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 1086 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  1m00.0s/1m0s

running (1m01.0s), 08/30 VUs, 1109 complete and 0 interrupted iterations
default ↓ [ 100% ] 30 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 1117    18.07425/s
    checks_succeeded...: 100.00% 1117 out of 1117
    checks_failed......: 0.00%   0 out of 1117

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=226.43ms min=53.78ms med=218.52ms max=1.55s p(90)=712.71ms p(95)=740.38ms
      { expected_response:true }...: avg=226.43ms min=53.78ms med=218.52ms max=1.55s p(90)=712.71ms p(95)=740.38ms
    http_req_failed................: 0.00%  0 out of 2234
    http_reqs......................: 2234   36.1485/s

    EXECUTION
    iteration_duration.............: avg=1.62s    min=1.27s   med=1.3s     max=8.45s p(90)=1.81s    p(95)=2.18s   
    iterations.....................: 1117   18.07425/s
    vus............................: 8      min=8         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 4.3 MB 70 kB/s
    data_sent......................: 205 kB 3.3 kB/s



running (1m01.8s), 00/30 VUs, 1117 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  1m0s